> f(x) = 10 * x
> f(10)
100
> f(x) = 11 * x
> f(2)
22
> f(x) = 10 + x
> f(1)
11
> f("str")
10str
