> var a = "10"
> a
10
> int(a)
10
> real(a)
10.0
> bigInt(a)
10
> int(13461435611241341231)
13461435611241341231
> str(112)
112
> str(int(10.0))
10
> str(real(10))
10.0
